<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"04f14060e734cbee0a3c63a429d90c7961b91e0676b3d6f31494c41ad0ec4e3c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1136 at https://github.com/cal-itp/data-infra/actions/runs/19973979738","plan_out_hash":"1003ebaa373906f88dd5b3e2236d72f37264bdd1eeb425ff916a76eea8481ac9","plan_hash":"dd79d6407e496593386f36ee303166702361bed46aa5cbe3bf28e3c099f13e90","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "a0fXqQ==" -> (known after apply)
!~      detect_md5hash      = "QmMH9YNTObKzJyk+UuM32A==" -> "different hash"
!~      generation          = 1762539327276751 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "QmMH9YNTObKzJyk+UuM32A==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1136](https://github.com/cal-itp/data-infra/actions/runs/19973979738)